In [1]:
import sqlite3 as sql

In [2]:
connection=sql.connect('example.db')
connection

In [3]:
cursor= connection.cursor()

In [9]:
cursor.execute(
    '''
    Create Table  If Not Exists employees
    (
    id Integer Primary Key,
    name Text Not Null,
    age Integer,
    department text
    )
    '''
)
##commit
connection.commit()

In [8]:
cursor.execute("DROP TABLE IF EXISTS employees")
connection.commit()

In [10]:
cursor.executemany('''
    INSERT INTO employees (id, name, age, department) VALUES (?, ?, ?, ?)
''', [
    (1, 'Nisha', 29, 'HR'),
    (2, 'Arjun', 35, 'Engineering'),
    (3, 'Meera', 26, 'Design'),
    (4, 'Rajat', 42, 'Marketing'),
    (5, 'Divya', 31, 'Finance')
])
connection.commit()

In [19]:
cursor.execute('SELECT * FROM employees')
result = cursor.fetchall()

for row in result:
    print(row)

(1, 'Nisha', 29, 'HR')
(2, 'Arjun', 35, 'Engineering')
(4, 'Rajat', 34, 'Marketing')
(5, 'Divya', 31, 'Finance')

In [15]:
cursor.execute(
    '''
    UPDATE  employees
    Set age=34
    where name="Rajat"
    '''
)
connection.commit()

In [18]:
cursor.execute(
    '''
    DELETE from employees
    where name="Meera"
    '''
)
connection.commit()